app/controllers/photos_controller.rb

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)

  def edit
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 2)

  def create
    @photo = Photo.new(params[:photo])
    @photo.user = @user

    respond_to do |format|
      if @photo.save
---
INSERT INTO `photos` (`image_file_size`, `updated_at`, `title`, `image_content_type`, `description`, `user_id`, `image_updated_at`, `created_at`, `image_file_name`) VALUES(51640, '2008-12-29 18:12:27', 'Stupid Cat', 'image/jpeg', 'haha lolz', NULL, '2008-12-29 18:12:27', '2008-12-29 18:12:27', 'funny-pictures-cat-is-having-trouble-catching-fish.jpg')

  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 2)
UPDATE `photos` SET `title` = 'Backpack Icon', `image_file_name` = 'backpack_icon.png', `image_file_size` = 11077, `image_content_type` = 'image/png', `description` = 'Icon from the number one rails app.', `image_updated_at` = '2008-12-29 18:28:52', `updated_at` = '2008-12-29 18:28:54' WHERE `id` = 2

  def load_user
    @user = params[:user_id] ? User.find(params[:user_id]) : current_user
---
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1