app/controllers/users_controller.rb

INSERT INTO `users` (`last_login_at`, `avatar_updated_at`, `last_request_at`, `updated_at`, `avatar_file_name`, `avatar_file_size`, `crypted_password`, `current_login_ip`, `password_salt`, `current_login_at`, `avatar_content_type`, `persistence_token`, `login_count`, `login`, `last_login_ip`, `created_at`) VALUES(NULL, '2008-12-29 18:00:58', NULL, '2008-12-29 18:00:59', 'the_eye.jpg', 2816, 'a390db06974b4a1eb9e53c31dce37629effd6a1ab20b46ff2c044fcecfea25e7de7a32733f8147cc3b63ccd8a7930439bf0c5a34198c914e086ce8bf21d81fa0', NULL, 'd5c35ead01819eed36503d22e33760df577d4b4acc261ff6367516e4668ed013e8200d65e833b924a7831c7ccbc5cdc7808efc64738c9042ec9d83800811d723', NULL, 'image/jpeg', 'b36ae6651f88e71f29e806ac78a4100a111b4e8e75b8cd689e211df103bcc96ca4249840cc70a30f523c0e724295dce0f63247275785750aefb031a24935d11c', NULL, 'Soleone', NULL, '2008-12-29 18:00:59')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

UPDATE `users` SET `updated_at` = '2008-12-29 18:42:20', `last_request_at` = '2008-12-29 18:42:20' WHERE `id` = 2
---
  def update
    @user = @current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])